Validation_Cases/CompressibleNACA0012/Fine_negSA/0/PaxHeaders.21019/alphat
29 atime=1566337514.29775165
30 ctime=1565968659.745945481
